
############################  Search PATH ################################

lappend search_path /home/IC/tsmc_fb_cl013g_sc/aci/sc-m/synopsys
lappend search_path /home/IC/Projects/System/RTL

########################### Define Top Module ############################
                                                   
set top_module SYS_TOP

######################### Formality Setup File ###########################

set synopsys_auto_setup true

set_svf "../../Synthesis/$top_module.svf"

####################### Read Reference tech libs ########################
 

set SSLIB "/home/IC/tsmc_fb_cl013g_sc/aci/sc-m/synopsys/scmetro_tsmc_cl013g_rvt_ss_1p08v_125c.db"
set TTLIB "/home/IC/tsmc_fb_cl013g_sc/aci/sc-m/synopsys/scmetro_tsmc_cl013g_rvt_tt_1p2v_25c.db"
set FFLIB "/home/IC/tsmc_fb_cl013g_sc/aci/sc-m/synopsys/scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c.db"

read_db -container Ref [list $SSLIB $TTLIB $FFLIB]

###################  Read Reference Design Files ######################## 

read_verilog -container Ref ALU_Top.v
read_verilog -container Ref Bin_to_Gray.v
read_verilog -container Ref BIT_SYNC.v
read_verilog -container Ref CLK_DIV.v
read_verilog -container Ref CLK_GATE.v
read_verilog -container Ref Data_Samoling.v
read_verilog -container Ref DATA_SYNC.v
read_verilog -container Ref Deselizer.v
read_verilog -container Ref Edge_Bit_CNTR.v
read_verilog -container Ref FIFO.v
read_verilog -container Ref FIFO_MEM.v
read_verilog -container Ref FSM_TX.v
read_verilog -container Ref MUX_Divider.v
read_verilog -container Ref MUX_TX.v
read_verilog -container Ref Parity_Calc_TX.v
read_verilog -container Ref Parity_check.v
read_verilog -container Ref Pulse_Gen.v
read_verilog -container Ref Register_File.v
read_verilog -container Ref rptr_fifo.v
read_verilog -container Ref rptr_fifo_GRAYED.v
read_verilog -container Ref RST_SYNC.v
read_verilog -container Ref Serilizer_Tx.v
read_verilog -container Ref Stop_Chck.v
read_verilog -container Ref STRT_CHECK.v
read_verilog -container Ref SYS_CTRL.v
read_verilog -container Ref SYS_TOP.v
read_verilog -container Ref TOP_UART_RX.v
read_verilog -container Ref TOTAL_UART.v
read_verilog -container Ref UART_RX_FSM.v
read_verilog -container Ref UART_Tx_TOP.v
read_verilog -container Ref wptr_fifo.v
read_verilog -container Ref wptr_fifo_GRAYED.v

######################## set the top Reference Design ######################## 

set_reference_design SYS_TOP
set_top SYS_TOP

####################### Read Implementation tech libs ######################## 

read_db -container Imp [list $SSLIB $TTLIB $FFLIB]

#################### Read Implementation Design Files ######################## 

read_verilog -container Imp -netlist "/home/IC/Projects/MY_SYSTEM/Backend/Synthesis/netlists/SYS_TOP.v"

####################  set the top Implementation Design ######################

set_implementation_design SYS_TOP
set_top SYS_TOP


## matching Compare points
match

## verify
set successful [verify]
if {!$successful} {
diagnose
analyze_points -failing
}

report_passing_points > "reports/passing_points.rpt"
report_failing_points > "reports/failing_points.rpt"
report_aborted_points > "reports/aborted_points.rpt"
report_unverified_points > "reports/unverified_points.rpt"


start_gui
